{
  "title": "Flashcards - C:\\Users\\gordo\\hackmit25\\lecture-assistant\\transcripts\\2025-09-14T08-49-08-624Z_American-History-high_school.txt",
  "description": "Study flashcards generated from lecture transcript",
  "cards": [
    {
      "term": "13 colonies",
      "definition": "What were the original American territories under British rule called?"
    },
    {
      "term": "Taxation without representation",
      "definition": "What was the primary colonial grievance against British rule?"
    },
    {
      "term": "1776",
      "definition": "In what year was the Declaration of Independence signed?"
    },
    {
      "term": "George Washington",
      "definition": "Who was the first President and Revolutionary War military leader?"
    },
    {
      "term": "Thomas Jefferson",
      "definition": "Who was the primary author of the Declaration of Independence?"
    },
    {
      "term": "Three branches",
      "definition": "How many branches of government did the Constitution establish?"
    },
    {
      "term": "Legislative branch",
      "definition": "Which branch of government is responsible for creating and passing laws?"
    },
    {
      "term": "Congress",
      "definition": "What is the name for the two houses of the legislative branch?"
    },
    {
      "term": "Senate and House of Representatives",
      "definition": "What are the two houses that make up Congress?"
    },
    {
      "term": "Bill of Rights",
      "definition": "What are the first ten amendments to the Constitution called?"
    },
    {
      "term": "Separation of powers",
      "definition": "What principle divides government power among three branches?"
    },
    {
      "term": "Federalists",
      "definition": "What group supported ratification of the Constitution and strong federal government?"
    },
    {
      "term": "British Parliament",
      "definition": "In which governing body did American colonists lack representation?"
    },
    {
      "term": "Bicameral legislature",
      "definition": "What type of legislature has two separate chambers or houses?"
    },
    {
      "term": "Checks and balances",
      "definition": "What system allows each government branch to limit other branches' power?"
    },
    {
      "term": "Constitutional law",
      "definition": "What type of law is based on the Constitution's principles?"
    },
    {
      "term": "Revolutionary War",
      "definition": "During which conflict did George Washington serve as military leader?"
    },
    {
      "term": "Democratic principles",
      "definition": "What type of governing principles formed the basis of American government?"
    },
    {
      "term": "Federal and state governments",
      "definition": "Between which two levels is power shared under federalism?"
    },
    {
      "term": "Individual liberties",
      "definition": "What does the Bill of Rights guarantee to American citizens?"
    }
  ],
  "createdAt": "2025-09-14T08:59:11.689Z",
  "sourceNotes": "## Colonial Period and British Rule\n\n### The 13 Colonies\n- **Definition**: The original 13 American colonies that would eventually become the United States\n- **Governance**: Under British colonial rul..."
}