{
  "title": "Flashcards - C:\\Users\\gordo\\hackmit25\\lecture-assistant\\transcripts\\2025-09-14T06-44-44-133Z_American-History-college.txt",
  "description": "Study flashcards generated from lecture transcript",
  "cards": [
    {
      "term": "Who was the President of the United States during the American Civil War?",
      "definition": "Abraham Lincoln, the 16th President of the United States, served as president during the entire Civil War period from 1861-1865. His leadership was crucial during this time of national division."
    },
    {
      "term": "American Civil War",
      "definition": "A major conflict in American history that lasted from 1861-1865, representing one of the most significant periods in the nation's development. It was fought between the Union (North) and the Confederacy (South) over issues including slavery and states' rights."
    },
    {
      "term": "What was the Gettysburg Address?",
      "definition": "The Gettysburg Address was one of Abraham Lincoln's most famous speeches, delivered on November 19, 1863, at the dedication of the Gettysburg National Cemetery. It honored the soldiers who died at the Battle of Gettysburg."
    },
    {
      "term": "Battle of Gettysburg",
      "definition": "A pivotal Civil War battle fought July 1-3, 1863, in Pennsylvania. It was one of the bloodiest battles of the war and marked a turning point, beginning the decline of the Confederacy's military fortunes."
    },
    {
      "term": "What number president was Abraham Lincoln?",
      "definition": "Abraham Lincoln was the 16th President of the United States, serving from 1861 until his assassination in 1865."
    },
    {
      "term": "When was the Gettysburg Address delivered?",
      "definition": "The Gettysburg Address was delivered on November 19, 1863, during the dedication ceremony for the Gettysburg National Cemetery."
    },
    {
      "term": "What was the historical significance of the Battle of Gettysburg?",
      "definition": "The Battle of Gettysburg was a turning point in the Civil War, marking the beginning of the Confederacy's decline. It was one of the war's bloodiest battles and demonstrated the Union's growing military advantage."
    },
    {
      "term": "Civil War timeline",
      "definition": "The American Civil War lasted from 1861 to 1865, spanning Abraham Lincoln's entire presidency. It began shortly after Lincoln took office and ended just before his assassination."
    },
    {
      "term": "What was the purpose of the Gettysburg Address?",
      "definition": "The Gettysburg Address was delivered to dedicate the Gettysburg National Cemetery and honor the soldiers who died in the Battle of Gettysburg. It became one of the most important speeches in American history."
    },
    {
      "term": "Why was Lincoln's leadership considered crucial during the Civil War?",
      "definition": "Lincoln's leadership was crucial because he guided the nation through its greatest crisis, maintaining the Union during a period of severe national division and civil conflict that threatened to permanently split the country."
    }
  ],
  "createdAt": "2025-09-14T06:45:55.891Z",
  "sourceNotes": "## I. Civil War Overview\n**Main Topic**: American Civil War\n- The lecture begins with an introduction to the Civil War as the primary subject of discussion\n- This represents one of the most significan..."
}