{
  "topic": {
    "subject": "American History",
    "subtopic": "Transcript With A Prompt Word.",
    "academicLevel": "high_school",
    "level": "high_school",
    "timestamp": "2025-09-14T13:45:01.192Z"
  },
  "generatedAt": "2025-09-14T13:45:11.669Z",
  "totalKeywords": 21,
  "keywords": {
    "transcript": "A transcript with a prompt word is a written record of a student's performance on an American History assessment.",
    "prompt word": "A word or phrase given to guide a student's response in an American History assignment or assessment.",
    "primary source": "A primary source is an original historical document or artifact that provides firsthand information about an event or time period.",
    "secondary source": "A secondary source is information about historical events that is not directly from the time period, such as textbooks or articles.",
    "historical document": "A historical document is a primary source that provides firsthand information about a past event or time period in American history.",
    "historical context": "The historical context refers to the specific time period, events, and societal factors that influenced a historical document or event.",
    "historical significance": "Historical significance refers to the importance or impact of an event, person, or development in American history.",
    "historical analysis": "Historical analysis: Examining and interpreting evidence from the past to understand American history and its significance.",
    "historical interpretation": "Historical interpretation is the analysis and understanding of past events from different perspectives in American History.",
    "historical perspective": "A historical perspective is the understanding of past events and their influence on the present in American history.",
    "historical bias": "Historical bias refers to the tendency of historical accounts to be influenced by the perspectives and experiences of the people who recorded them.",
    "historical accuracy": "Historical accuracy refers to the factual correctness of information about past events in American history.",
    "historical reliability": "Historical reliability refers to the accuracy and trustworthiness of historical sources and evidence in American History.",
    "historical validity": "Historical validity refers to the accuracy and authenticity of historical information or sources in American History.",
    "historical evidence": "Historical evidence refers to primary sources and artifacts that provide factual information about past events in American history.",
    "historical argument": "A historical argument is a claim about the past supported by evidence from historical sources.",
    "historical narrative": "A historical narrative is an account that tells the story of events, people, and ideas in American history.",
    "historical synthesis": "A historical synthesis is the process of combining and analyzing various historical sources to develop a comprehensive understanding of a topic in American history.",
    "historical causation": "Historical causation refers to the factors and events that directly lead to and influence significant historical outcomes in American history.",
    "historical continuity": "Historical continuity refers to the uninterrupted progression of events, ideas, and influences that shape the development of American history.",
    "historical change": "Historical change refers to significant shifts or transformations in American society, politics, or culture over time."
  }
}