{
  "topic": {
    "subject": "American History",
    "subtopic": "World War Ii.",
    "academicLevel": "high_school",
    "level": "high_school",
    "timestamp": "2025-09-14T03:41:44.657Z"
  },
  "generatedAt": "2025-09-14T03:41:58.036Z",
  "keywords": {
    "world war ii": "World War II: A global military conflict from 1939-1945 that involved the United States and its alli",
    "isolationism": "Isolationism: A policy of avoiding involvement in international affairs and conflicts, as practiced ",
    "appeasement": "Appeasement: A policy of making concessions to an aggressor to avoid conflict, as practiced by the U",
    "fascism": "Fascism: An authoritarian, nationalist political ideology that dominated parts of Europe during WWII",
    "nazism": "Nazism: The fascist political ideology of the German Nazi party that led to World War II.",
    "militarism": "Militarism: The belief that a nation should maintain a strong military capability and be prepared to",
    "totalitarianism": "Totalitarianism: A system of government with complete control over a country and its citizens, as se",
    "pearl harbor": "Pearl Harbor: The surprise Japanese attack on the U.S. naval base in Hawaii that led to America's en",
    "attack on pearl harbor": "The surprise military attack by Japan on the U.S. naval base at Pearl Harbor in 1941, which led to A",
    "infamy speech": "The \"Infamy Speech\" is the address given by President Franklin D. Roosevelt to Congress, declaring t",
    "axis powers": "The Axis Powers were the alliance of Germany, Italy, and Japan during World War II.",
    "allied powers": "The Allied Powers in World War II were the countries, led by the United States, Britain, and the Sov",
    "lend-lease act": "The Lend-Lease Act was a U.S. program that provided military aid to Allies during WWII.",
    "arsenal of democracy": "The \"Arsenal of Democracy\" refers to the United States' role as the primary supplier of weapons and ",
    "d-day": "D-Day: The Allied invasion of Normandy, France on June 6, 1944, a major turning point in World War I",
    "normandy invasion": "The Normandy Invasion was the Allied amphibious assault on Nazi-occupied France during World War II,",
    "battle of stalingrad": "The Battle of Stalingrad was a major World War II battle between the Soviets and Nazi Germany, marki",
    "manhattan project": "The Manhattan Project was the secret U.S. program during WWII that developed the first atomic bombs.",
    "atomic bomb": "The Atomic Bomb was a devastating weapon developed during WWII that used nuclear fission to create a",
    "hiroshima": "Hiroshima: The Japanese city where the first atomic bomb was dropped by the U.S. in 1945, ending WWI",
    "nagasaki": "Nagasaki: The second city in Japan to be devastated by an atomic bomb dropped by the U.S. during WWI",
    "ve day": "VE Day: The day in 1945 when Nazi Germany surrendered, ending World War II in Europe for the United ",
    "vj day": "VJ Day: The day Japan surrendered, ending World War II, celebrated as Victory over Japan Day in the ",
    "holocaust": "The Holocaust refers to the systematic genocide of European Jews and other groups by Nazi Germany du",
    "nuremberg trials": "The Nuremberg Trials were a series of trials that prosecuted Nazi leaders for war crimes and crimes "
  }
}